# Group by ...

most important topic

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = sns.load_dataset('tips')

In [4]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [5]:
df['total_bill'].sum()

np.float64(4827.77)

In [6]:
type(df['total_bill'].sum())

numpy.float64

In [9]:
df.isna()

     total_bill    tip    sex  smoker    day   time   size
0         False  False  False   False  False  False  False
1         False  False  False   False  False  False  False
2         False  False  False   False  False  False  False
3         False  False  False   False  False  False  False
4         False  False  False   False  False  False  False
..          ...    ...    ...     ...    ...    ...    ...
239       False  False  False   False  False  False  False
240       False  False  False   False  False  False  False
241       False  False  False   False  False  False  False
242       False  False  False   False  False  False  False
243       False  False  False   False  False  False  False

[244 rows x 7 columns]

In [10]:
#if you want to know how many blank value are there in data 
df.isna().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

### Agrigation function

In [13]:
round(df['tip'].mean())

3

In [14]:
round(df['total_bill'].mean())

20

In [15]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

## count,minimum,maximum,mean,sum,average , standard varience

these are gorup by functionss...jo input me value too bhut le lete hai but output bhut kamm dete hai sidha result

In [16]:
df['time']

0      Dinner
1      Dinner
2      Dinner
3      Dinner
4      Dinner
        ...
239    Dinner
240    Dinner
241    Dinner
242    Dinner
243    Dinner
Name: time, Length: 244, dtype: category
Categories (2, object): ['Lunch', 'Dinner']

In [17]:
df['time'].unique()

['Dinner', 'Lunch']
Categories (2, object): ['Lunch', 'Dinner']

In [20]:
#jaise isme total bill ka sum pucha usne by default tip or size ka bhi bata diya isliye isme kujh galti hai ..jo ki next me clear hai
df.groupby(['time']).sum(['total_bill'])

C:\Users\inder\AppData\Local\Temp\ipykernel_9940\1124504927.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['time']).sum(['total_bill'])

        total_bill     tip  size
time
Lunch      1167.47  185.51   164
Dinner     3660.30  546.07   463

In [21]:
df#total bill ko separete krna hoga hmme
df.groupby(['time'])['total_bill'].sum()

C:\Users\inder\AppData\Local\Temp\ipykernel_9940\4125006083.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['time'])['total_bill'].sum()

time
Lunch     1167.47
Dinner    3660.30
Name: total_bill, dtype: float64

In [39]:
#jo upr warning aa rhi woh isloye hau kyuki woh chahta hai jaise row me kujh cheeje use na ho aise hi prri rehti ho woh khali bekar cheejo k liye hmne usse ignore krna hota hai 
df.groupby(['time' ], observed = True)['total_bill'].sum()

time
Lunch     1167.47
Dinner    3660.30
Name: total_bill, dtype: float64

In [23]:
gender = df.groupby(['sex'] , observed = True)

In [25]:
gender['total_bill'].sum()

sex
Male      3256.82
Female    1570.95
Name: total_bill, dtype: float64

In [26]:
gender['total_bill'].count()

sex
Male      157
Female     87
Name: total_bill, dtype: int64

In [27]:
gender.count()

        total_bill  tip  smoker  day  time  size
sex
Male           157  157     157  157   157   157
Female          87   87      87   87    87    87

In [29]:
#matlab kitne ka bill divide by kitne male or females 
gender['total_bill'].sum() / gender['total_bill'].count()

sex
Male      20.744076
Female    18.056897
Name: total_bill, dtype: float64

### Multi category gruping

In [30]:
gt = df.groupby(['sex' , 'time'],observed = True)

In [31]:
gt['total_bill'].sum()

sex     time
Male    Lunch      595.60
        Dinner    2661.22
Female  Lunch      571.87
        Dinner     999.08
Name: total_bill, dtype: float64

In [32]:
gt.sum(['total_bill'])

               total_bill     tip  size
sex    time
Male   Lunch       595.60   95.11    78
       Dinner     2661.22  389.96   335
Female Lunch       571.87   90.40    86
       Dinner      999.08  156.11   128

In [33]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [37]:
dt = df.groupby(['day','time'],observed = False)

In [38]:
dt.sum('total_bill')

             total_bill     tip  size
day  time
Thur Lunch      1077.55  168.83   150
     Dinner       18.78    3.00     2
Fri  Lunch        89.92   16.68    14
     Dinner      235.96   35.28    26
Sat  Lunch         0.00    0.00     0
     Dinner     1778.40  260.40   219
Sun  Lunch         0.00    0.00     0
     Dinner     1627.16  247.39   216